[AbilityPoint X2ItemTemplate]
FriendlyName="Prime Tactical Data"
FriendlyNamePlural="Prime Tactical Data"
BriefSummary="Tactical Data that can be used to assist XCOM Operatives in learning new skills."

[AHWSpawnEasyWave X2AbilityTemplate]
LocFriendlyName="Difficulty: Radiant Dawn"
LocLongDescription="Those who would risk little, shall find naught but meagre rewards."
LocHelpText="Those who would risk little, shall find naught but meagre rewards."
LocFlyOverText="Radiant Dawn"

[AHWSpawnMediumWave X2AbilityTemplate]
LocFriendlyName="Difficulty: Dimmed Noon"
LocLongDescription="Confidence, Bravery, and Grit. The Three Qualities of a Survivor. The path may be difficult, but treasures await the triumphant."
LocHelpText="Confidence, Bravery and Grit. The Three Qualities of a Survivor. The path may be difficult, but treasures await the triumphant."
LocFlyOverText="Dimmed Noon"

[AHWSpawnHardWave X2AbilityTemplate]
LocFriendlyName="Difficulty: Setting Sun"
LocLongDescription="Remind yourself that overconfidence is a slow and insidious killer.."
LocHelpText="Remind yourself that overconfidence is a slow and insidious killer.."
LocFlyOverText="Setting Sun"

[AHWSpawnBrutalWave X2AbilityTemplate]
LocFriendlyName="Difficulty: Tenebrous Twilight"
LocLongDescription="We dance upon the razor's edge, but 'O, The Rewards.."
LocHelpText="We dance upon the razor's edge, but 'O, The Rewards.."
LocFlyOverText="Tenebrous Twilight"

[AHWSpawnAbsurdWave X2AbilityTemplate]
LocFriendlyName="Difficulty: Luminous Night"
LocLongDescription="The Earth rings like a drum, and the Skies roil.. This, is the personal attention of an Elder.."
LocHelpText="The Earth rings like a drum, and the Skies roil.. This, is the personal attention of an Elder.."
LocFlyOverText="Luminous Night"

[AHWSupplyRaidSurvival X2MissionTemplate]
DisplayName="Onslaught Survival"
Briefing="A High Ranking ADVENT Defector has sabotaged a UFO carrying extremely valuable supplies, forcing it to perform an emergency landing in this region. We've been coordinating with local Resistance bands in this area to loot everything from it that we can. Unfortunately, ADVENT has already dispatched forces to secure the UFO and the surrounding regions. Resistance forces in this region aren't equipped well enough to take on ADVENT in a full on firefight, so it's up to us and a few volunteers to distract ADVENT. The more time we can buy them, the more of them will be able to get away, and the bigger our cut of the loot will be."
PostMissionType="Onslaught Survival"
BriefingImage="img:///UILibrary_MissionImages.Missions_Flight_Device"
ObjectiveTextPools[0]="Survive Onslaught Waves to Earn Loot"
ObjectiveTextPools[1]="Higher Difficulty Onslaughts Generate Greater Loot"
ObjectiveTextPools[2]="EVAC will only be available between Onslaughts"
ObjectiveTextPools[3]="The Defector Must Survive."

[AHWSupplyRaidSurvival X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Survive Onslaught Waves to Earn Loot"
ObjectiveTextPools[1]="The Defector Must Survive"
ObjectiveTextPools[2]="Extract all XCOM Operatives"
ObjectiveTextPools[3]="ONSLAUGHT SURVIVAL"
ObjectiveTextPools[4]="This Mission is focused around The Defector, an ADVENT Officer who controls the Onslaught Waves settings, and the mission only ends when XCOM's Operatives Evac or are Wiped Out. If The Defector dies, you can no longer call additional Onslaught Waves. \n\nUnlike normal Supply Raids, Supplies obtained are determined by the number of Onslaughts that have been successfully completed, and their difficulty setting, rather than recovered crates. The first wave Automatically triggers, and will default to the Radiant Dawn difficulty."
ObjectiveTextPools[5]="OPTIONAL: Locate lingering Resistance Forces to Bolster your Squad's Survivability"
ObjectiveTextPools[6]="SKYRANGER DETECTED"
ObjectiveTextPools[7]="Alien Sensor Systems have locked onto the Skyranger! \n\nADVENT is deploying in an overwhelmingly massive assault force to eradicate XCOM's Forces and recover the UFO!"